Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB288.atdf
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1" />
         <value caption="Posc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1" />
         <value caption="Sosc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1" />
         <value caption="LPRC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Divided System PLL Ready Status bit" name="CLKSTAT__DIVSPLLRDY">
         <value caption="Divided System PLL is ready" name="" value="0x2" />
         <value caption="Divided System PLL is not ready" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00158" name="CRYPTO" version="1">
      <register-group name="CRYPTO">
         <register caption="Crypto Engine Revision" name="CEVER" offset="0x0" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="ID" />
            <bitfield mask="0x00FF0000" name="VERSION" />
            <bitfield mask="0xFF000000" name="REVISION" />
         </register>
         <register caption="Crypto Engine Control Register" name="CECON" offset="0x4" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="CECON__DMAEN" />
            <bitfield caption="Buffer Descriptor Processor Poll Enable bit" mask="0x00000002" name="BDPPLEN" values="CECON__BDPPLEN" />
            <bitfield caption="Buffer Descriptor Processor Fetch Enable bit" mask="0x00000004" name="BDPCHST" values="CECON__BDPCHST" />
            <bitfield caption="Input Data Swap Enable bit" mask="0x00000020" name="SWAPEN" values="CECON__SWAPEN" />
            <bitfield caption="Software Reset bit" mask="0x00000040" name="SWRST" values="CECON__SWRST" />
            <bitfield caption="Swap Output Data Enable bit" mask="0x00000080" name="SWAPOEN" values="CECON__SWAPOEN" />
         </register>
         <register caption="Crypto Engine Buffer Descriptor Register" name="CEBDADDR" offset="0x8" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BDPADDR" />
         </register>
         <register caption="Crypto Engine Buffer Descriptor Processor Register" name="CEBDPADDR" offset="0xc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR" />
         </register>
         <register caption="Crypto Engine Status Register" name="CESTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="BDCTRL" />
            <bitfield caption="Buffer Descriptor Processor Status bit" mask="0x00010000" name="ACTIVE" values="CESTAT__ACTIVE" />
            <bitfield caption="DMA Start Status bit" mask="0x00020000" name="START" values="CESTAT__START" />
            <bitfield caption="Buffer Descriptor Processor State Status bits" mask="0x003C0000" name="BDSTATE" values="CESTAT__BDSTATE" />
            <bitfield caption="Internal Error Phase of DMA Status bits" mask="0x03000000" name="ERRPHASE" values="CESTAT__ERRPHASE" />
            <bitfield caption="Internal Error Operation Status bits" mask="0x1C000000" name="ERROP" values="CESTAT__ERROP" />
            <bitfield caption="Internal Error Mode Status bits" mask="0xE0000000" name="ERRMODE" values="CESTAT__ERRMODE" />
         </register>
         <register caption="Crypto Engine Interrupt Source Register" name="CEINTSRC" offset="0x14" rw="R" size="4">
            <bitfield caption="Crypto Engine Interrupt Pending Status bit" mask="0x00000001" name="PENDIF" values="CEINTSRC__PENDIF" />
            <bitfield caption="BD Transmit Status bit" mask="0x00000002" name="CBDIF" values="CEINTSRC__CBDIF" />
            <bitfield caption="DMA Packet Completion Interrupt Status bit" mask="0x00000004" name="PKTIF" values="CEINTSRC__PKTIF" />
            <bitfield caption="Access Response Error Interrupt bit" mask="0x00000008" name="AREIF" values="CEINTSRC__AREIF" />
         </register>
         <register caption="Crypto Engine Interrupt Enable Register" name="CEINTEN" offset="0x18" rw="RW" size="4">
            <bitfield caption="Master Interrupt Enable bit" mask="0x00000001" name="PENDIE" values="CEINTEN__PENDIE" />
            <bitfield caption="DMA Buffer Descriptor Processor Interrupt Enable bit" mask="0x00000002" name="BDPIE" values="CEINTEN__BDPIE" />
            <bitfield caption="DMA Packet Completion Interrupt Enable bit" mask="0x00000004" name="PKTIE" values="CEINTEN__PKTIE" />
            <bitfield caption="Access Response Error Interrupt Enable bit" mask="0x00000008" name="AREIE" values="CEINTEN__AREIE" />
         </register>
         <register caption="Crypto Engine Poll Control Register" name="CEPOLLCON" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BDPPLCON" />
         </register>
         <register caption="Crypto Engine Header Length Register" name="CEHDLEN" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="HDRLEN" />
         </register>
         <register caption="Crypto Engine Trailer Length Register" name="CETRLLEN" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="TRLRLEN" />
         </register>
      </register-group>
      <value-group caption="DMA Enable bit" name="CECON__DMAEN">
         <value caption="Crypto Engine DMA is enabled" name="" value="0x1" />
         <value caption="Crypto Engine DMA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Processor Poll Enable bit" name="CECON__BDPPLEN">
         <value caption="Poll for descriptor until valid bit is set" name="" value="0x1" />
         <value caption="Do not poll" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Processor Fetch Enable bit" name="CECON__BDPCHST">
         <value caption="BDP descriptor fetch is enabled" name="" value="0x1" />
         <value caption="BDP descriptor fetch is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Data Swap Enable bit" name="CECON__SWAPEN">
         <value caption="Input data is byte swapped when read by dedicated DMA" name="" value="0x1" />
         <value caption="Input data is not byte swapped when read by dedicated DMA" name="" value="0x0" />
      </value-group>
