Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB288.atdf
      <value-group caption="Automatic Self Refresh Enable bit" name="DDRPWRCFG__ASLFREFEN">
         <value caption="Allow automatic entry into Self Refresh mode." name="" value="0x1" />
         <value caption="Do not allow automatic entry into Self Refresh mode." name="" value="0x0" />
      </value-group>
      <value-group caption="Refresh Count bits" name="DDRPWRCFG__PWRDNDLY">
         <value caption="1020 clocks" name="" value="0xff" />
         <value caption="4 clocks" name="" value="0x1" />
      </value-group>
      <value-group caption="Self Refresh Delay bits" name="DDRPWRCFG__SLFREFDLY">
         <value caption="2111452 clocks" name="" value="0x1ff" />
         <value caption="1024 clocks" name="" value="0x1" />
      </value-group>
      <value-group caption="Precharge Power Down Only bit" name="DDRPWRCFG__PCHRGPWRDN">
         <value caption="Allow automatic entry into Precharge Power Down mode." name="" value="0x1" />
         <value caption="Do not allow automatic entry into Precharge Power Down mode." name="" value="0x0" />
      </value-group>
      <value-group caption="Big Endian bit" name="DDRXFERCFG__BIGENDIAN">
         <value caption="Data is big endian format" name="" value="0x1" />
         <value caption="Data is little endian format" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Read Enable bit" name="DDRODTENCFG__ODTREN">
         <value caption="The Chip Select represented by the OTDCSEN bits (DDRODTCFG&lt;7:0&gt;) has ODT enabled for data writes" name="" value="0x1" />
         <value caption="The Chip Select represented by the OTDCSEN bits (DDRODTCFG&lt;7:0&gt;) has ODT disabled for data writes" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Write Enable bit" name="DDRODTENCFG__ODTWEN">
         <value caption="The Chip Select represented by the OTDCSEN bits (DDRODTCFG&lt;7:0&gt;) has ODT enabled for data reads" name="" value="0x1" />
         <value caption="The Chip Select represented by the OTDCSEN bits (DDRODTCFG&lt;7:0&gt;) has ODT disabled for data reads" name="" value="0x0" />
      </value-group>
      <value-group caption="Half-rate Mode bit" name="DDRMEMWIDTH__HALFRATE">
         <value caption="Half-rate mode" name="" value="0x1" />
         <value caption="Full-rate mode" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00213" name="DDR_PHY" version="1">
      <register-group name="DDR_PHY">
         <register caption="DDL SELF CALIBRATION LOGIC START REGISTER" name="DDRSCLSTART" offset="0x0" rw="RW" size="4">
            <bitfield caption="Self Calibration Logic Lower Data Byte Status bit" mask="0x00000001" name="SCLLBPASS" values="DDRSCLSTART__SCLLBPASS" />
            <bitfield caption="Self Calibration Logic Upper Data Byte Status bit" mask="0x00000002" name="SCLUBPASS" values="DDRSCLSTART__SCLUBPASS" />
            <bitfield caption="Self Calibration Logic Enable bit" mask="0x04000000" name="SCLEN" values="DDRSCLSTART__SCLEN" />
            <bitfield caption="Start Self Calibration Logic bit" mask="0x10000000" name="SCLSTART" values="DDRSCLSTART__SCLSTART" />
         </register>
         <register caption="DDL Self Calibration Logic Latency Register" name="DDRSCLLAT" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CAPCLKDLY" />
            <bitfield mask="0x000000F0" name="DDRCLKDLY" />
         </register>
         <register caption="DDR SCL Configuration Register 0" name="DDRSCLCFG0" offset="0x18" rw="RW" size="4">
            <bitfield caption="PHY Burst 8 bit" mask="0x00000001" name="BURST8" values="DDRSCLCFG0__BURST8" />
            <bitfield caption="DDR2 bit" mask="0x00000002" name="DDR2" values="DDRSCLCFG0__DDR2" />
            <bitfield mask="0x000000F0" name="RCASLAT" />
            <bitfield caption="On-Die Termination Chip Select Write bit" mask="0x01000000" name="ODTCSW" values="DDRSCLCFG0__ODTCSW" />
         </register>
         <register caption="DDR SCL Configuration Register 1" name="DDRSCLCFG1" offset="0x1c" rw="RW" size="4">
            <bitfield caption="SCL Chip Select Enable bit" mask="0x00000001" name="SCLCSEN" values="DDRSCLCFG1__SCLCSEN" />
            <bitfield mask="0x00000F00" name="WCASLAT" />
            <bitfield caption="Double Reference Delay bit" mask="0x00001000" name="DBLREFDLY" values="DDRSCLCFG1__DBLREFDLY" />
         </register>
         <register caption="DDR PHY Pad Control Register" name="DDRPHYPADCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="On-Die Termination Select bit" mask="0x00000001" name="ODTSEL" values="DDRPHYPADCON__ODTSEL" />
            <bitfield caption="On-Die Termination Enable bit" mask="0x00000002" name="ODTEN" values="DDRPHYPADCON__ODTEN" />
            <bitfield caption="Data Pad Drive Strength Select bit" mask="0x00000004" name="DATDRVSEL" values="DDRPHYPADCON__DATDRVSEL" />
            <bitfield caption="Address and Control Pads Drive Strength Select bit" mask="0x00000008" name="ADDCDRVSEL" values="DDRPHYPADCON__ADDCDRVSEL" />
            <bitfield mask="0x00000030" name="ODTPDCAL" />
            <bitfield caption="On-Die Termination Pull-up Calibration bits" mask="0x000000C0" name="ODTPUCAL" values="DDRPHYPADCON__ODTPUCAL" />
            <bitfield caption="Extra Output Enable bit" mask="0x00000100" name="EOENCLKCYC" values="DDRPHYPADCON__EOENCLKCYC" />
            <bitfield caption="No External DLL bit" mask="0x00000200" name="NOEXTDLL" values="DDRPHYPADCON__NOEXTDLL" />
            <bitfield caption="Write Command Delay bit" mask="0x00002000" name="WRCMDDLY" values="DDRPHYPADCON__WRCMDDLY" />
            <bitfield caption="Half Rate bit" mask="0x00004000" name="HALFRATE" values="DDRPHYPADCON__HALFRATE" />
            <bitfield caption="NFET Drive Strength bits" mask="0x000F0000" name="DRVSTRNFET" values="DDRPHYPADCON__DRVSTRNFET" />
            <bitfield caption="PFET Drive Strength bits" mask="0x00F00000" name="DRVSTRPFET" values="DDRPHYPADCON__DRVSTRPFET" />
            <bitfield caption="Receiver Enable bit" mask="0x10000000" name="RCVREN" values="DDRPHYPADCON__RCVREN" />
            <bitfield caption="Preamble Delay bits" mask="0x60000000" name="PREAMBDLY" values="DDRPHYPADCON__PREAMBDLY" />
         </register>
