Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB288.atdf
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC8CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC8CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC8CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC8CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC8CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC8CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC8CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC9CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC9CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC9CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC9CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC9CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC9CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC9CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC9CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC9CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02907" name="INT" version="3">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield mask="0x007F0000" name="VS" />
            <bitfield mask="0xFF000000" name="NMIKEY" />
         </register>
