Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB288.atdf
      <value-group caption="Force Event for Auto CMD12 Index Error bit" name="SDHCFE__FEACIDXE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Command Not Issued by Auto CMD12 Error bit" name="SDHCFE__FECNIACE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Command Time-out Error bit" name="SDHCFE__FECTOE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Command CRC Error bit" name="SDHCFE__FECCRCE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Command End Bit Error bit" name="SDHCFE__FECEBE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Command Index Error bit" name="SDHCFE__FEIDXE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Data Time-out Error bit" name="SDHCFE__FEDTOE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Data CRC Error bit" name="SDHCFE__FEDCRCE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Data End Bit Error bit" name="SDHCFE__FEDEBE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Current-Limit Error bit" name="SDHCFE__FECLE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Auto CMD 12 Error bit" name="SDHCFE__FEACE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01329" name="SPI" version="2">
      <register-group name="SPI">
         <register caption="SPI Control Register" name="SPI1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI1CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI1CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI1CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI1CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI1CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI1CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI1CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI1CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI1CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI1CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI1CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI1CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI1CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00800000" name="MCLKSEL" values="SPI1CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI1CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI1CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI1CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI1CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI1CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI1CON__FRMEN"/>
         </register>
         <register caption="SPI Control Register" name="SPI2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI2CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI2CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI2CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI2CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI2CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI2CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI2CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI2CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI2CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN"/>
         </register>
         <register caption="SPI Control Register" name="SPI3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI3CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI3CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI3CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI3CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI3CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI3CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI3CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI3CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI3CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI3CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI3CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI3CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI3CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI3CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI3CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI3CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI3CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI3CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI3CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI3CON__FRMEN"/>
         </register>
         <register caption="SPI Control Register" name="SPI4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI4CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI4CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI4CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI4CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI4CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI4CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI4CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI4CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI4CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI4CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI4CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI4CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI4CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI4CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI4CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI4CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI4CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI4CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI4CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI4CON__FRMEN"/>
         </register>
         <register caption="SPI Control Register" name="SPI5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI5CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI5CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI5CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI5CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI5CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI5CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI5CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI5CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI5CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI5CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI5CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI5CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI5CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI5CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI5CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI5CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI5CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI5CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI5CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI5CON__FRMEN"/>
         </register>
         <register caption="SPI Control Register" name="SPI6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI6CON__SRXISEL"/>
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI6CON__STXISEL"/>
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI6CON__DISSDI"/>
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI6CON__MSTEN"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI6CON__CKP"/>
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI6CON__SSEN"/>
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI6CON__CKE"/>
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI6CON__SMP"/>
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI6CON__DISSDO"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI6CON__SIDL"/>
            <bitfield caption="SPI/I 2 S Module On bit" mask="0x00008000" name="ON" values="SPI6CON__ON"/>
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI6CON__ENHBUF"/>
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI6CON__SPIFE"/>
            <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI6CON__MCLKSEL"/>
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." mask="0x07000000" name="FRMCNT" values="SPI6CON__FRMCNT"/>
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI6CON__FRMSYPW"/>
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI6CON__MSSEN"/>
            <bitfield caption="Frame Sync Polarity bit" mask="0x20000000" name="FRMPOL" values="SPI6CON__FRMPOL"/>
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit" mask="0x40000000" name="FRMSYNC" values="SPI6CON__FRMSYNC"/>
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI6CON__FRMEN"/>
         </register>
